
   
# 1) მომხმარებელს შემოატანინეთ input-ის მეშვეობით თავისი სახელი, შეინახეთ იგი ცვლადში და ბეჭდეთ მიღებული მნიშვნელობა.

# 2) მომხარებელს შემოატანინეთ 2 ცალი რიცხვი სხვადასხვა დამოუკიდებელი input-ის მეშვეობით, ამის შემდეგ კი უბრალოდ დაბეჭდეთ ამ შემოყვანილი რიცხვების ჯამი. (დაგჭირდებათ int() ფუნქცია)

# 3) მომხმარებელს შემოატანინეთ თავისი ასაკი, თქვენი დავალებაა შემოყვანილი მნიშვნელობა გადაიყვანოთ integer ტიპის მონმაცემად და საბოლოოდ დაბეჭდოთ მომხმარებლის მიერ შემოყვანილი მნიშვნელობის მონაცემთა ტიპი.

# 4) შექმენით 3 ცვლადი, თითოულ ცვლადში შეინახეთ 1 მონაცემთა ტიპის მნიშვნელობა, თქვენი დავალებაა კი საბოლოოდ დაბეჭდოთ ამ ცვლადების მონაცემტა ტიპები. -->


name = input("enter ypur name")
print(name)


num1 = int(input("enter your number:"))
num2 = int(input("enter your number:"))

print(num1+num2)

age=int(input("enter your age:"))
print(age)

o=1
i=2
r=4
print(type(0))
print(type(i))
print(type(r))

