# 1) დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 

# 2) დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
 
# 3) დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 

# 4) დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ

# 5) დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში

# 6) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი

# 7) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop

# 8) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

# 9) დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ


# 1)
for i in range(39):
    print(i)

# 2)
for i in range(30,40):
    print(i)

# 3)
for i in range(12,120):
    print(i)

# 4)
for i in range(18):
    print("luka")
    print(15)

# 5)
for i in range(10,100,3):
    print(i)

# 6)
for i in range(30):
    print("1 ფორთოხალო")
    print("2 ფორთოხალო")
    print("3 ფორთოხალო")
    print("4 ფორთოხალო")
    print("5 ფორთოხალო")
    print("6 ფორთოხალო")
    print("7 ფორთოხალო")
    print("8 ფორთოხალო")
    print("9 ფორთოხალო")
    print("10 ფორთოხალო")
    print("11 ფორთოხალო")
    print("12 ფორთოხალო")
    print("13 ფორთოხალო")
    print("14 ფორთოხალო")
    print("15 ფორთოხალო")
    print("16 ფორთოხალო")
    print("17 ფორთოხალო")
    print("18 ფორთოხალო")
    print("19 ფორთოხალო")
    print("20 ფორთოხალო")
    print("21 ფორთოხალო")
    print("22 ფორთოხალო")
    print("23 ფორთოხალო")
    print("24 ფორთოხალო")
    print("25 ფორთოხალო")
    print("26 ფორთოხალო")
    print("27 ფორთოხალო")
    print("28 ფორთოხალო")
    print("29 ფორთოხალო")
    print("20 ფორთოხალო")

# 7)
name = input("enter your name:")
for i in range(13):
    print(name)

# 8)
num = 10
while num >= 0:
    print("luka")
    num -= 1

# 9)
num = 0
while num >= 24:
    print("num")
    num += 1

# 10)
# num = 0
# while num >= 234:
#     print("num")
#     num += 1
#     num = 0
# while num >= 244:
#     print("num")
#     num += 1
#     num = 0
# while num >= 254:
#     print("num")
#     num += 1
#     num = 0
# while num >= 264:
#     print("num")
#     num += 1
#     num = 0
# while num >= 274:
#     print("num")
#     num += 1
#     num = 0
# while num >= 284:
#     print("num")
#     num += 1
#     num = 0
# while num >= 294:
#     print("num")
#     num += 1
