# Level 03
# 1) გააკეთეთ 2-2 მაგალითი თითო მათემატიკურ ოპერატორებზე


# 2) შექმენით 5 ცვლადი -->
# პირველ ცვლადში შეინახეთ ინფორმაცია თქვენი სახელის შესაახებ.

# მეორე ცვლადში შეინახეთ ინფორმაცია თქვენი ასაკის შესახებ.

# მესამე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი ფერის შესახებ.

# მეოთხე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი საკვების შესახებ.

# მეხუთე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი მანქანის შესახებ.

# main task: ააგეთ ერთი დიდი წინადადება ცვლადების დახმარებით როგორც გაკვეთილზე მაგალითის სახით გავაკეთეთ.

# 1

print(1+1)
print(2+2)

print(3-3)
print(3-4)

print(5*5)
print(6*9)


print(3/3)
print(3/1)

print(6//4)
print(9//5)

print(5%5)
print(4%2)

num1 = "luka"
num2 = "15"
num3 = "purple"
num4 = "shawarma"
num5 = "ferrary sf90 stradale"


print("my name is " + num1 +  "my age is "+ num2 + "my favourite color is " + num3 + "my favourite food is"+ num4 +"my fav car is "+num5  )