# Level 20
# 1) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი არის 10-ზე დაბეჭდეთ "{ჩასვამთ რიცხვს, რომელსაც მომხარებელი შემოიყვანს} არის 10-ზე ნაკლები", სხვა შემთხევევაში თუ 20-ზე ნაკლებია დაბეჭდავთ "{ჩასვამთ რიცხვს, რომელსაც მომხარებელი შემოიყვანს} არის 20-ზე ნაკლები"

# 2) მომხმარებელს შემოატანინეთ ამინდი და თუ ის არის "მზიანი", დაბეჭდეთ "ვივარჯიშებ გარეთ", სხვა შემთხვევაში თუ "წვიმიანი", დაბეჭდეთ "ვივარჯიშებ გარეთ", ხოლო სხვა დანარჩენ შემთხვევაში დაბეჭდეთ "არ ვივარჯიშებ დღეს"


num = input("enter your number")
if num < 10:
    print("არის 10-ზე ნაკლები")
elif num<20:
    print("არის 20-ზე ნაკლები")w